# Lendo os registro do EXCEL

In [381]:
#Importando Classe Pandas
import pandas as pd
import datetime

In [382]:
#Leitura do arquivo XLS... obs Mudar o caminho do arquivo abaixo em caso de teste ...

df = pd.concat(pd.read_excel("/home/jovyan/workspace/ExcelRaizen.xlsx", sheet_name=None), ignore_index=True)

In [384]:
#Leitura Inicial dos dados
#data.head()
data = df

In [385]:
#Adicionando a coluna Created_AT 
#Verificando o novo layout dos dados
data1 = data.rename(columns={'UN. DA FEDERAÇÃO': 'UF','ANO':'Year','Dados':'Month','PRODUTO':'Product','UNIDADE':'Unit','Total':'Volume'},inplace=False)
data1['Created_at'] = pd.Timestamp.today()

In [386]:
#Criacao de uma estrutura de apoio para converter os meses em numeros
#Concatenacao dos campos Year + Month
look_up = {'Janeiro': '1', 'Fevereiro': '2', 'Março': '3', 'Abril': '4', 'Maio': '5',
            'Junho': '6', 'Julho': '7', 'Agosto': '8', 'Setembro': '9', 'Outubro': '10', 'Novembro': '11', 'Dezembro': '12'}
data1['Month'] = data1['Month'].apply(lambda x: look_up[x])
data1['Volumne'] = data1['Volume'].fillna(0)
data1['YearMonth'] = pd.to_datetime(data1['Year'].map(str) + data1['Month'], format="%Y%m")

In [387]:
#Definindo um novo lauyout com um novo DataFrame
data2 = pd.DataFrame(data1, columns = ['YearMonth','UF','Product','Unit','Volume','Created_at'])
print(data2)
data2.dtypes

       YearMonth         UF                     Product Unit  Volume  \
0     2013-01-01       ACRE  ÓLEO DIESEL (OUTROS ) (m3)   m3     8.0
1     2013-02-01       ACRE  ÓLEO DIESEL (OUTROS ) (m3)   m3     8.0
2     2013-03-01       ACRE  ÓLEO DIESEL (OUTROS ) (m3)   m3    58.0
3     2013-04-01       ACRE  ÓLEO DIESEL (OUTROS ) (m3)   m3    17.0
4     2013-05-01       ACRE  ÓLEO DIESEL (OUTROS ) (m3)   m3     0.0
...          ...        ...                         ...  ...     ...
67387 2020-08-01  TOCANTINS   QUEROSENE ILUMINANTE (m3)   m3     0.0
67388 2020-09-01  TOCANTINS   QUEROSENE ILUMINANTE (m3)   m3     0.0
67389 2020-10-01  TOCANTINS   QUEROSENE ILUMINANTE (m3)   m3     NaN
67390 2020-11-01  TOCANTINS   QUEROSENE ILUMINANTE (m3)   m3     NaN
67391 2020-12-01  TOCANTINS   QUEROSENE ILUMINANTE (m3)   m3     NaN

                      Created_at
0     2021-07-04 22:22:53.455676
1     2021-07-04 22:22:53.455676
2     2021-07-04 22:22:53.455676
3     2021-07-04 22:22:53.455676
4     2021-07-04 22:22:53.455676
...                          ...
67387 2021-07-04 22:22:53.455676
67388 2021-07-04 22:22:53.455676
67389 2021-07-04 22:22:53.455676
67390 2021-07-04 22:22:53.455676
67391 2021-07-04 22:22:53.455676

[67392 rows x 6 columns]

YearMonth     datetime64[ns]
UF                    object
Product               object
Unit                  object
Volume               float64
Created_at    datetime64[ns]
dtype: object

# Gravando e Lendo os Registros no MySQL

In [388]:
import pandas as pd
import sqlalchemy

In [389]:
engine = sqlalchemy.create_engine('mysql+pymysql://root:root@172.21.128.1:3307/raizen')

In [390]:
df = pd.read_sql_table('t_raizen',engine)

In [391]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67392 entries, 0 to 67391
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   yearmonth   67392 non-null  datetime64[ns]
 1   uf          67392 non-null  object
 2   product     67392 non-null  object
 3   unit        67392 non-null  object
 4   volume      66339 non-null  float64
 5   created_at  67392 non-null  datetime64[ns]
dtypes: datetime64[ns](2), float64(1), object(3)
memory usage: 3.1+ MB

In [392]:
data2.to_sql('t_raizen', con = engine, if_exists = 'append', chunksize = 1000, index=False)

In [393]:
dfMySQL = pd.read_sql('select date_format(yearmonth,"%%Y_%%m") as "Year_Month", uf, product, unit, volume, created_at  from raizen.t_raizen limit 10',engine)
dfMySQL

,Year_Month,uf,product,unit,volume,created_at
0,2013_01,ACRE,ÓLEO DIESEL (OUTROS ) (m3),m3,8.0,2021-07-04 16:09:09
1,2013_02,ACRE,ÓLEO DIESEL (OUTROS ) (m3),m3,8.0,2021-07-04 16:09:09
2,2013_03,ACRE,ÓLEO DIESEL (OUTROS ) (m3),m3,58.0,2021-07-04 16:09:09
3,2013_04,ACRE,ÓLEO DIESEL (OUTROS ) (m3),m3,17.0,2021-07-04 16:09:09
4,2013_05,ACRE,ÓLEO DIESEL (OUTROS ) (m3),m3,0.0,2021-07-04 16:09:09
5,2013_06,ACRE,ÓLEO DIESEL (OUTROS ) (m3),m3,0.0,2021-07-04 16:09:09
6,2013_07,ACRE,ÓLEO DIESEL (OUTROS ) (m3),m3,0.0,2021-07-04 16:09:09
7,2013_08,ACRE,ÓLEO DIESEL (OUTROS ) (m3),m3,0.0,2021-07-04 16:09:09
8,2013_09,ACRE,ÓLEO DIESEL (OUTROS ) (m3),m3,0.0,2021-07-04 16:09:09
9,2013_10,ACRE,ÓLEO DIESEL (OUTROS ) (m3),m3,0.0,2021-07-04 16:09:09